# Chess Queen Moves
# Ходы шахматного ферзя


# На шахматной доске 8 х 8 стоит ферзь. 
# Отметьте положение ферзя на доске и все клетки, которые бьет ферзь. Клетку, где стоит ферзь, отметьте буквой Q,
# клетки, которые бьет ферзь, отметьте звездочками *, остальные клетки заполните точками. Шахматный ферзь может ходить по вертикали, 
# горизонтали и по диагоналям.

# Входные данные:

# Координаты ферзя на шахматной доске в формате номер столбца (буква от a до h, слева направо) и номер строки (цифра от 1 до 8, снизу вверх).

# Пример ввода:
c4

# Выходные данные:

# Программа выводит стилизованное изображение шахматной доски со схемой возможных передвижений ферзя.

# Пример вывода:

. . * . . . * .
. . * . . * . .
* . * . * . . .
. * * * . . . .
* * Q * * * * *
. * * * . . . .
* . * . * . . .
. . * . . * . .


# Решение
# Способ 1:
